Revit 2026 API

# BuiltInFailuresKeyBasedTreeFileFailures Class

---

Failures occurred when reading key based tree text file.

SystemObject Autodesk.Revit.DBBuiltInFailuresKeyBasedTreeFileFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class KeyBasedTreeFileFailures
```
```vb
Public NotInheritable Class KeyBasedTreeFileFailures
```
```cpp
public ref class KeyBasedTreeFileFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type KeyBasedTreeFileFailures = class end
```

The BuiltInFailuresKeyBasedTreeFileFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotOpenFileForRead | Cannot open file [FileName]. |
|  | CannotUnderstandAtLine | Cannot understand [EntryType] line '[Number]' |

#### Reference

Autodesk.Revit.DB Namespace